ConnectTest/src/Catalogs/СоответствиеЗапросовИсточникамИнформации/СоответствиеЗапросовИсточникамИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СоответствиеЗапросовИсточникамИнформации</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВыполнятьВФоне</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСохранятьОтветВЛогах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СжиматьЛоги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоДляСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсточникиИнформации</name>
    <attributes>
      <name>Атрибут</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыполнятьВФоне</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапросИсточник</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗапросПриемник</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникИнформации</name>
      <type>
        <types>CatalogRef.ИсточникиИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>НеИспользовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеСохранятьОтветВЛогах</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СжиматьЛоги</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоДляСотрудников</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ConnectTest/src/Catalogs/СоответствиеЗапросовИсточникамИнформации/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Для Каждого СтрокаТЧ Из ИсточникиИнформации Цикл
		СтрокаТЧ.ЗапросИсточник			= Код;
		СтрокаТЧ.ВыполнятьВФоне			= ВыполнятьВФоне;
		СтрокаТЧ.ТолькоДляСотрудников	= ТолькоДляСотрудников;
		СтрокаТЧ.НеСохранятьОтветВЛогах	= НеСохранятьОтветВЛогах;
	КонецЦикла;
КонецПроцедуры
